hedfd434/stm32f746g-disco-sonar-with-HC-SR04-sensor/Core/Src/main.c
/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(100);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartTask04 */
/**
* @brief Function implementing the GetData thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTask04 */
void StartTask04(void *argument)
{
  /* USER CODE BEGIN StartTask04 */
  /* Infinite loop */
  for(;;)
  {
	  //	  left_limiter = HAL_GPIO_ReadPin(GPIOB, left_end_stop_Pin);
	  //	  if(left_limiter == 0)
	  //	  {
	  //		  HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, 1);
	  //	  }
	  	  //calibrate motor
	  	  if(calibrate == 0)
	  	  {
	  		  while(1)
	  		  	  {
	  		  		  //do 1 step, it's rotating cunter cloockwise looking from top

	  		  		  //step1
	  		  		  HAL_GPIO_WritePin(GPIOI, orange_Pin, 1);
	  		  		  HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	  		  		  HAL_Delay(motor_delay);

	  		  		  //step2
	  		  		  HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOB, blue_Pin, 1);
	  		  		  HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	  		  		  HAL_Delay(motor_delay);

	  		  		  //step3
	  		  		  HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOA, pink_Pin, 1);
	  		  		  HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	  		  		  HAL_Delay(motor_delay);

	  		  		  //step4
	  		  		  HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	  		  		  HAL_GPIO_WritePin(GPIOA, yellow_Pin, 1);
	  		  		  HAL_Delay(motor_delay);

	  		  		  //if object reached the maximum left limiter = 1
	  		  		  left_limiter = HAL_GPIO_ReadPin(GPIOB, left_end_stop_Pin);

	  		  		  if(left_limiter == 0) //left end stop pressed
	  		  		  {
	  //		  			  HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, 1);
	  		  			  calibrate = 1;
	  		  			  steps = 0;
	  		  			  break;
	  		  		  }
	  		  		  else if(left_limiter == 1)
	  		  		  {
	  //		  			  HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, 0);
	  		  		  }
	  		  	  }
	  	  }
	  	  steps = 0;
	  	  while(1)
	  	  {
	  		  //do 1 step, it's rotating cloockwise looking from top
	  		  //step1
	  		  HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	  		  HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	  		  HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	  		  HAL_GPIO_WritePin(GPIOA, yellow_Pin, 1);
	  		  HAL_Delay(motor_delay);

	  		  //step2
	  		  HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	    	  HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	    	  HAL_GPIO_WritePin(GPIOA, pink_Pin, 1);
	    	  HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	    	  HAL_Delay(motor_delay);

	  		  //step3
	    	  HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	    	  HAL_GPIO_WritePin(GPIOB, blue_Pin, 1);
	    	  HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	    	  HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	    	  HAL_Delay(motor_delay);

	  		  //step4
	    	  HAL_GPIO_WritePin(GPIOI, orange_Pin, 1);
	    	  HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	    	  HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	    	  HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	    	  HAL_Delay(motor_delay);


	  		  steps++;

	  		  right_limiter = HAL_GPIO_ReadPin(GPIOB, right_end_stop_Pin);

	  		  if(right_limiter == 0) //left end stop pressed
	  		  {
	  			  //send amount of steps to model
	  			  HAL_GPIO_TogglePin(GPIOF, GPIO_PIN_6);
	  			  steps = 210;
//	  			  value1 = steps;
//	  			  value2 = 10;
//	  			  data_to_send = value1<<8;
//	  			  data_to_send = data_to_send|value2;
//	  		  	  osMessageQueuePut(distance_sensor_dataHandle, &data_to_send, 0, 0);
	  		  	  break;
	  		  }
	  	  }
	  	  while(1)
	  	  {
	  	  		//do 1 step, it's rotating counter cloockwise looking from top
	  	  		//step1
	  	  		HAL_GPIO_WritePin(GPIOI, orange_Pin, 1);
	  	  		HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	  	  		HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	  	  		HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	  	  		HAL_Delay(motor_delay);

	  	  		//step2
	  	    	HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	  	    	HAL_GPIO_WritePin(GPIOB, blue_Pin, 1);
	  	    	HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	  	    	HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	  	    	HAL_Delay(motor_delay);

	  	  		  //step3
	  	    	HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	  	    	HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	  	    	HAL_GPIO_WritePin(GPIOA, pink_Pin, 1);
	  	    	HAL_GPIO_WritePin(GPIOA, yellow_Pin, 0);
	  	    	HAL_Delay(motor_delay);

	  	  		  //step4
	  	    	HAL_GPIO_WritePin(GPIOI, orange_Pin, 0);
	  	    	HAL_GPIO_WritePin(GPIOB, blue_Pin, 0);
	  	    	HAL_GPIO_WritePin(GPIOA, pink_Pin, 0);
	  	    	HAL_GPIO_WritePin(GPIOA, yellow_Pin, 1);
	  	    	HAL_Delay(motor_delay);


	  	  		steps--;

	  	  		left_limiter = HAL_GPIO_ReadPin(GPIOB, left_end_stop_Pin);

	  	  		if(left_limiter == 0) //left end stop pressed
	  	  		{
	  	  			//send amount of steps to model
	  	  			HAL_GPIO_TogglePin(GPIOF, GPIO_PIN_6);
	  	  			steps = 0;
//	  	  			steps = 20;
//	  	  			value1 = steps;
//	  	  			value2 = 10;
//	  	  			data_to_send = value1<<8;
//	  	  			data_to_send = data_to_send|value2;
//	  	  			osMessageQueuePut(distance_sensor_dataHandle, &data_to_send, 0, 0);
	  	  		  	break;
	  	  		}
	  	  }
	  //
    osDelay(1);
  }
  /* USER CODE END StartTask04 */
}

/* USER CODE BEGIN Header_StartTask05 */
/**
* @brief Function implementing the myTask05 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTask05 */
void StartTask05(void *argument)
{
  /* USER CODE BEGIN StartTask05 */
  /* Infinite loop */
  for(;;)
  {
  	  HAL_GPIO_WritePin(TRIG_PORT, TRIG_PIN, GPIO_PIN_SET);  // pull the TRIG pin HIGH
  	  __HAL_TIM_SET_COUNTER(&htim1, 0);
  	  while (__HAL_TIM_GET_COUNTER (&htim1) < 10);  // wait for 10 us
  	  HAL_GPIO_WritePin(TRIG_PORT, TRIG_PIN, GPIO_PIN_RESET);  // pull the TRIG pin low

  	  pMillis = HAL_GetTick(); // used this to avoid infinite while loop  (for timeout)
  	  // wait for the echo pin to go high
  	  while (!(HAL_GPIO_ReadPin (ECHO_PORT, ECHO_PIN)) && pMillis + 10 >  HAL_GetTick());
  	  Value1 = __HAL_TIM_GET_COUNTER (&htim1);

  	  pMillis = HAL_GetTick(); // used this to avoid infinite while loop (for timeout)
  	  // wait for the echo pin to go low
  	  while ((HAL_GPIO_ReadPin (ECHO_PORT, ECHO_PIN)) && pMillis + 50 > HAL_GetTick());
  	  Value2 = __HAL_TIM_GET_COUNTER (&htim1);

  	  Distance = (Value2-Value1)* 0.034/2;

//	  	  Distance = HAL_GetTick();

